let questions = [
    {
        "question": "在家的時間變多了，你會？",
        "answers": [
            ["變瘦", 2],
            ["變胖", 3],
        ]
    },
    {
        "question": "消除壓力的方式是？",
        "answers": [
            ["吃東西/去喝酒", 4],
            ["購物", 5]
        ]
    },
    {
        "question": "和朋友去旅行的話？",
        "answers": [
            ["希望可以少數人一起去", 6],
            ["一群人也不成問題", 7],
        ]
    },
    {
        "question": "和朋友的朋友初次見面就能打成一片？",
        "answers": [
            ["能", 8],
            ["不能，需要一點時間", 9]
        ]
    },
    {
        "question": "是否規劃著將來的人生？",
        "answers": [
            ["相比之下是有的", 10],
            ["傾向活在當下", 11]
        ]
    },
    {
        "question": "覺得自己在喜歡上某個人事物時，會展現「癡迷」的一面？",
        "answers": [
            ["覺得", 9],
            ["不覺得", 11]
        ]
    },
    {
        "question": "1個人獨處的時候，會覺得？",
        "answers": [
            ["有點寂寞", 8],
            ["相對輕鬆", 10]
        ]
    },
    {
        "question": "如果想出去喝一杯或吃點東西，你會？",
        "answers": [
            ["看重CP值", 12],
            ["選擇常去的", 13]
        ]
    },
    {
        "question": "喜歡哪一種時尚？",
        "answers": [
            ["時下的流行", 14],
            ["古著", 15]
        ]
    },
    {
        "question": "周遭的人對你的印象是？",
        "answers": [
            ["看起來很強勢", 16],
            ["不拘小節", 17]
        ]
    },
    {
        "question": "和男性吃飯平分餐費的經驗？",
        "answers": [
            ["從來沒有", 18],
            ["不是沒有過", 19]
        ]
    },
    {
        "question": "比較喜歡？",
        "answers": [
            ["待在家", "澀谷女子"],
            ["和朋友相處的時間", "三茶軒屋女子"]
        ]
    },
    {
        "question": "在同齡群體中的角色是？",
        "answers": [
            ["姐姐的類型", "代代木上原女子"],
            ["老么的類型", "上野女子"]
        ]
    },
    {
        "question": "知道「飯撒」的意思嗎？",
        "answers": [
            ["知道", "新大久保女子"],
            ["不知道", "表參道女子"]
        ]
    },
    {
        "question": "常被別人形容「與眾不同」？",
        "answers": [
            ["經常被說", "上野女子"],
            ["不常被說", "高圓寺女子"]
        ]
    },
    {
        "question": "會做「諂媚」的行為嗎？",
        "answers": [
            ["不會想這麼做", "六本木女子"],
            ["必要時會", "銀座女子"]
        ]
    },
    {
        "question": "眾人聚集在一起的節日和活動是否讓你感到熱血沸騰？",
        "answers": [
            ["超嗨！", "上野女子"],
            ["好像一般般", "代代木上原女子"]
        ]
    },
    {
        "question": "會花錢在自己身上嗎？",
        "answers": [
            ["會", "西麻布女子"],
            ["不會", "歌舞伎町女子"]
        ]
    },
    {
        "question": "生活方式和個性是哪一種呢？",
        "answers": [
            ["樂觀正向", "六本木女子"],
            ["憂鬱悲觀", "澀谷女子"]
        ]
    }



];

let finalAnswers = {
    "歌舞伎町女子": ["歌舞伎町女子", "總而言之當下很重要、本身是個害怕寂寞的人、喜歡的人就是活著的理由、做事相當地有幹勁、比起存錢更會花錢、交友關係廣卻淺薄、喜惡分明", "images/2.jpg"],
    "新大久保女子": ["新大久保女子", "喜歡韓國文化、說話會混夾韓語、愛好美容的保濕命、想變成纖細的身材、是「肉搜」能力的神、憧憬的偶像，就是自己的生活動力、想馬上就飛去韓國", "images/3.jpg"],
    "六本木女子": ["六本木女子", "只要自己滿意就OK、個性比想像中的還要大喇喇、不會諂媚也不想、對女孩子還比對男人溫柔、認為戀愛的本質是純潔的、身份是辣妹、看重氣氛和場面", "images/4.jpg"],
    "高圓寺女子": ["高圓寺女子", "基本上性格是很害羞的、一旦交情變好後就會非常親密、喜歡「渣男」、即便會自嘲也保持著樂觀的心、喜歡古著、音樂、覺得事物保持原樣很好", "images/5.jpg"],
    "澀谷女子": ["澀谷女子", "經常在SNS更新貼文、想追上時下的潮流、在意瑣碎的小事、擁有多個面向、ON/OFF模式切換自如、會跳Tik Tok上的最新舞蹈、很常自己感受到孤獨", "images/6.jpg"],
    "三軒茶屋女子": ["三軒茶屋女子", "團體意識很高、喜歡熱鬧的場合、喜歡認識去新的朋友、行動力很高、有點跟風、平時想喝酒的動機相當高、喜歡身邊的每一個人", "images/7.jpg"],
    "上野女子": ["上野女子", "不拘小節且落落大方、不把別人的批評當一回事、擅長照顧他人但有時也會覺得麻煩、熱愛青春氣息的祭典、傾向中間管理職、喜歡家人和故鄉、有時候還滿固執的", "images/8.jpg"],
    "表參道女子": ["表參道女子", "不拘小節且落落大方、不把別人的批評當一回事、擅長照顧他人但有時也會覺得麻煩、熱愛青春氣息的祭典、傾向中間管理職、喜歡家人和故鄉、有時候還滿固執的", "images/9.jpg"],
    "代代木上原女子": ["代代木上原女子", "不拘小節且落落大方、不把別人的批評當一回事、擅長照顧他人但有時也會覺得麻煩、熱愛青春氣息的祭典、傾向中間管理職、喜歡家人和故鄉、有時候還滿固執的", "images/10.jpg"],
    "下北澤女子": ["下北澤女子", "走在潮流的尖端、有著確切的興趣、想要與眾不同、擅長獨自行動、喜歡小眾、想好好重視與身俱來的個性、內在是可靠的", "images/11.jpg"],
    "西麻布女子": ["西麻布女子", "得失心很重、想讓錢花得有價值、精打细算深得人心、重視自我提升、喜歡名牌、事實是個勤奮的人、常吸引到爛男人", "images/12.jpg"],
    "銀座女子": ["銀座女子", "言談舉止都相當優雅、有著確切的人生規、覺得自己的幸福掌握在自己的手中、善於閱讀空氣、屬於女強人的類型、會誠實地照顧他人、不會向他人展現自己的弱點", "images/1.jpg"],
}; 3